#+TITLE: Using rxjs in orgy

* Rxjs

#+BEGIN_SRC typescript
module Play {
    export class Playground {
        constructor(private text : string) {
        }
        say() :void{
            console.log(this.text);
        }
    }
}
var result : Play.Playground = new Play.Playground("module name");
result.say();
#+END_SRC

#+RESULTS:
: module name

* Examples

#+BEGIN_SRC typescript :wrap SRC js
module Greeting {
    export class Hello {
        constructor(private text : string) {
        }
        say() :void{
            console.log(this.text);
        }
    }
}

var hello : Greeting.Hello = new Greeting.Hello("Hello, World!");
hello.say();
#+END_SRC

#+RESULTS:
#+BEGIN_SRC js
var Greeting;
(function (Greeting) {
    var Hello = /** @class */ (function () {
        function Hello(text) {
            this.text = text;
        }
        Hello.prototype.say = function () {
            console.log(this.text);
        };
        return Hello;
    }());
    Greeting.Hello = Hello;
})(Greeting || (Greeting = {}));
var hello = new Greeting.Hello("Hello, World!");
hello.say();
#+END_SRC
